# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'stripe/stripe-cli'	-- payment infrastructure for the internet

# Binaries
# brew 'awscli'			-- command line interface for Amazon web services; could be useful when using Amazon braket
brew 'bash' 			# Latest Bash version
brew 'coreutils' 		# Those that come with macOS are outdated
brew 'cmake'			# Cross platform compiler; mainly used for C/C++
#brew 'gh'			# GitHub CLI
brew 'git'
brew 'git-filter-repo'		# Quickly rewrite git repository history
brew 'gnupg'			# GNU Privacy Guard to encrypt data (used in tlmgr)
brew 'libomp			# LLVM's OpenMP runtime library
brew 'mackup'			# Backup App preferences to a cloud storage
brew 'mas' 			# Mac App Store CLI
brew 'openconnect'		# Open client for Cisco AnyConnect VPN
brew 'pkg-config'		# Helper tool to compile applications and libraries
brew 'pyenv'
#brew 'svn' 			# Needed to install fonts

# Apps
cask 'adobe-acrobat-reader'	
cask 'basictex'
#cask 'caffeine'
cask 'clion'
cask 'discord'
# cask 'docker'			-- Software for isolating applications in containers
cask 'flutter'
#cask 'github'
cask 'google-chrome'
cask 'inkscape'
# cask 'insomnia'		-- Design, debug, and test APIs locally or in the cloud
cask 'intellij-idea'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'onedrive'
cask 'pycharm'
# cask 'slack'			-- Team communication and collaboration software
cask 'spotify'
cask 'texshop'
# cask 'tuple'			-- Remote pair programming app
cask 'whatsapp'
cask 'zoom'

# Mac App Store
mas 'Keynote', id: 409183694
