# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'stripe/stripe-cli'	-- payment infrastructure for the internet

# Binaries
# brew 'awscli'			-- command line interface for Amazon web services; could be useful when using Amazon braket
brew 'bash' 			# Latest Bash version
brew 'coreutils' 		# Those that come with macOS are outdated
brew 'gh'			# GitHub CLI
brew 'git'
brew 'mackup'			# Backup App preferences to a cloud storage
brew 'mas' 			# Mac App Store CLI
brew 'pkg-config'		# helper tool to compile applications and libraries
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' 			# Needed to install fonts

# Apps
cask 'caffeine'
cask 'discord'
# cask 'docker'			-- Software for isolating applications in containers
cask 'github'
cask 'google-chrome'
# cask 'insomnia'		-- Design, debug, and test APIs locally or in the cloud
# cask 'slack'			-- Team communication and collaboration software
# cask 'tuple'			-- Remote pair programming app
# cask 'visual-studio-code'	-- Editor by Microsoft
cask 'zoom'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'Spring', id: 1508706541
mas 'Things', id: 904280696
