# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'stripe/stripe-cli'	-- payment infrastructure for the internet

# Binaries
# brew 'awscli'			-- command line interface for Amazon web services; could be useful when using Amazon braket
brew 'bash' 			# Latest Bash version
brew 'coreutils' 		# Those that come with macOS are outdated
brew 'gh'			# GitHub CLI
brew 'git'
brew 'gnupg'			# GNU Privacy Guard to encrypt data (used in tlmgr)
brew 'mackup'			# Backup App preferences to a cloud storage
brew 'mas' 			# Mac App Store CLI
brew 'pkg-config'		# Helper tool to compile applications and libraries
brew 'pyenv'
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' 			# Needed to install fonts

# Apps
cask 'adobe-acrobat-reader'	
cask 'basictex'
cask 'caffeine'
cask 'discord'
# cask 'docker'			-- Software for isolating applications in containers
cask 'github'
cask 'google-chrome'
# cask 'insomnia'		-- Design, debug, and test APIs locally or in the cloud
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'onedrive'
cask 'pycharm'
# cask 'slack'			-- Team communication and collaboration software
cask 'spotify'
# cask 'tuple'			-- Remote pair programming app
# cask 'visual-studio-code'	-- Editor by Microsoft
cask 'whatsapp'
cask 'zoom'

# Mac App Store
mas 'Keynote', id: 409183694
